//*******************************************************************************************
// GLOBAL VARAIBLES
////*******************************************************************************************
//פונקציות מתכון
var USER_LIKE = null;
var USER_FAVORITE = null;
// פרטי המתכון
var ARRY_RECIPES;
var COUNT_RECIPES = 1;
var COUNT_NAME_RECIPES = 1;
var ARRY_RECIPES_DISPLAY = new Array();
//*******************************************************************************************
// PAGE LOAD
//*******************************************************************************************
$(document).ready(function () {
    // להביא נתונים סטטים
    

});

//*******************************************************************************************
// GET USER LIKE
//*******************************************************************************************

//*******************************************************************************************
// GET BU AND FU RECIPE 
//*******************************************************************************************
function Get_BUandFU_Recipes() {
    GlobalAjax("/api/Recipe/GetAllRecipesOf_BU_AND_FU", "GET", "", SuccessGet_BUandFU_Recipes, FailGet_BUandFU_Recipes);
}

function SuccessGet_BUandFU_Recipes() {

}

function FailGet_BUandFU_Recipes() {

}
